#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dev.azurerm_kubernetes_cluster.cluster will be created
  + resource "azurerm_kubernetes_cluster" "cluster" {
      + dns_prefix                 = "aks"
      + enable_pod_security_policy = (known after apply)
      + fqdn                       = (known after apply)
      + id                         = (known after apply)
      + kube_admin_config          = (known after apply)
      + kube_admin_config_raw      = (sensitive value)
      + kube_config                = (known after apply)
      + kube_config_raw            = (sensitive value)
      + kubernetes_version         = "1.12.6"
      + location                   = "uksouth"
      + name                       = "aks-dev"
      + node_resource_group        = (known after apply)
      + resource_group_name        = "aks-cluster-dev"
      + tags                       = (known after apply)

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
            }
        }

      + agent_pool_profile {
          + count           = 1
          + dns_prefix      = (known after apply)
          + fqdn            = (known after apply)
          + max_pods        = (known after apply)
          + name            = "aks"
          + os_disk_size_gb = (known after apply)
          + os_type         = "Linux"
          + type            = "AvailabilitySet"
          + vm_size         = "Standard_D2s_v3"
          + vnet_subnet_id  = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "basic"
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + client_app_id     = (known after apply)
              + server_app_id     = (known after apply)
              + server_app_secret = (sensitive value)
              + tenant_id         = (known after apply)
            }
        }

      + service_principal {
          + client_id     = "69d1a453-31c9-4dd1-927b-a7043e2b1730"
          + client_secret = (sensitive value)
        }
    }

  # module.dev.azurerm_network_security_group.sg will be created
  + resource "azurerm_network_security_group" "sg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "aks-nsg-dev"
      + resource_group_name = "aks-cluster-dev"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTPS"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTP"
              + priority                                   = 1002
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = (known after apply)
    }

  # module.dev.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "aks-cluster-dev"
      + tags     = (known after apply)
    }

  # module.dev.azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = "10.1.0.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + ip_configurations                              = (known after apply)
      + name                                           = "aks-subnet-dev"
      + network_security_group_id                      = (known after apply)
      + resource_group_name                            = "aks-cluster-dev"
      + virtual_network_name                           = "aks-vnet-dev"
    }

  # module.dev.azurerm_virtual_network.network will be created
  + resource "azurerm_virtual_network" "network" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "aks-vnet-dev"
      + resource_group_name = "aks-cluster-dev"
      + tags                = (known after apply)

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

  # module.dev.helm_release.ingress will be created
  + resource "helm_release" "ingress" {
      + chart            = "stable/nginx-ingress"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "ingress"
      + namespace        = "default"
      + recreate_pods    = false
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 300
      + verify           = false
      + version          = (known after apply)
      + wait             = true

      + set {
          + name  = "rbac.create"
          + value = "true"
        }
    }

  # module.preprod.azurerm_kubernetes_cluster.cluster will be created
  + resource "azurerm_kubernetes_cluster" "cluster" {
      + dns_prefix                 = "aks"
      + enable_pod_security_policy = (known after apply)
      + fqdn                       = (known after apply)
      + id                         = (known after apply)
      + kube_admin_config          = (known after apply)
      + kube_admin_config_raw      = (sensitive value)
      + kube_config                = (known after apply)
      + kube_config_raw            = (sensitive value)
      + kubernetes_version         = "1.12.6"
      + location                   = "uksouth"
      + name                       = "aks-preprod"
      + node_resource_group        = (known after apply)
      + resource_group_name        = "aks-cluster-preprod"
      + tags                       = (known after apply)

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
            }
        }

      + agent_pool_profile {
          + count           = 1
          + dns_prefix      = (known after apply)
          + fqdn            = (known after apply)
          + max_pods        = (known after apply)
          + name            = "aks"
          + os_disk_size_gb = (known after apply)
          + os_type         = "Linux"
          + type            = "AvailabilitySet"
          + vm_size         = "Standard_D2s_v3"
          + vnet_subnet_id  = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "basic"
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + client_app_id     = (known after apply)
              + server_app_id     = (known after apply)
              + server_app_secret = (sensitive value)
              + tenant_id         = (known after apply)
            }
        }

      + service_principal {
          + client_id     = "69d1a453-31c9-4dd1-927b-a7043e2b1730"
          + client_secret = (sensitive value)
        }
    }

  # module.preprod.azurerm_network_security_group.sg will be created
  + resource "azurerm_network_security_group" "sg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "aks-nsg-preprod"
      + resource_group_name = "aks-cluster-preprod"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTPS"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTP"
              + priority                                   = 1002
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = (known after apply)
    }

  # module.preprod.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "aks-cluster-preprod"
      + tags     = (known after apply)
    }

  # module.preprod.azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = "10.1.0.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + ip_configurations                              = (known after apply)
      + name                                           = "aks-subnet-preprod"
      + network_security_group_id                      = (known after apply)
      + resource_group_name                            = "aks-cluster-preprod"
      + virtual_network_name                           = "aks-vnet-preprod"
    }

  # module.preprod.azurerm_virtual_network.network will be created
  + resource "azurerm_virtual_network" "network" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "aks-vnet-preprod"
      + resource_group_name = "aks-cluster-preprod"
      + tags                = (known after apply)

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

  # module.preprod.helm_release.ingress will be created
  + resource "helm_release" "ingress" {
      + chart            = "stable/nginx-ingress"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "ingress"
      + namespace        = "default"
      + recreate_pods    = false
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 300
      + verify           = false
      + version          = (known after apply)
      + wait             = true

      + set {
          + name  = "rbac.create"
          + value = "true"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Warning: "network_security_group_id": [DEPRECATED] Use the `azurerm_subnet_network_security_group_association` resource instead.

  on aks-module/main.tf line 69, in resource "azurerm_subnet" "subnet":
  69: resource "azurerm_subnet" "subnet" {



Warning: "network_security_group_id": [DEPRECATED] Use the `azurerm_subnet_network_security_group_association` resource instead.

  on aks-module/main.tf line 69, in resource "azurerm_subnet" "subnet":
  69: resource "azurerm_subnet" "subnet" {



Warning: "agent_pool_profile": [DEPRECATED] This has been replaced by `default_node_pool` and will be removed in version 2.0 of the AzureRM Provider

  on aks-module/main.tf line 77, in resource "azurerm_kubernetes_cluster" "cluster":
  77: resource "azurerm_kubernetes_cluster" "cluster" {



Warning: "agent_pool_profile": [DEPRECATED] This has been replaced by `default_node_pool` and will be removed in version 2.0 of the AzureRM Provider

  on aks-module/main.tf line 77, in resource "azurerm_kubernetes_cluster" "cluster":
  77: resource "azurerm_kubernetes_cluster" "cluster" {


```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
